## 📦 Terraform Plan Result
Terraform Plan Output:
```
Acquiring state lock. This may take a few moments...
data.google_project.project: Reading...
data.google_iam_policy.noauth: Reading...
data.google_iam_policy.noauth: Read complete after 0s [id=3450855414]
data.google_project.project: Read complete after 0s [id=projects/stalwart-camera-463819-k5]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_cloud_run_service.vector will be created
  + resource "google_cloud_run_service" "vector" {
      + autogenerate_revision_name = true
      + id                         = (known after apply)
      + location                   = "europe-west3"
      + name                       = "audio-dev-collector"
      + project                    = "stalwart-camera-463819-k5"
      + status                     = (known after apply)

      + metadata (known after apply)

      + template {
          + metadata (known after apply)
          + spec {
              + container_concurrency = 1000
              + service_account_name  = (known after apply)
              + serving_state         = (known after apply)
              + timeout_seconds       = 300

              + containers {
                  + image = "europe-west3-docker.pkg.dev/stalwart-camera-463819-k5/vector-audio-repository/my-vector-local:565d514"
                  + name  = (known after apply)

                  + env {
                      + name  = "GOMEMLIMIT"
                      + value = "512MiB"
                    }

                  + ports {
                      + container_port = 8080
                      + name           = (known after apply)
                    }

                  + resources {
                      + limits = {
                          + "cpu"    = "1"
                          + "memory" = "512Mi"
                        }
                    }

                  + startup_probe (known after apply)

                  + volume_mounts {
                      + mount_path = "/etc/vector/"
                      + name       = "audio-dev-config"
                    }
                }

              + volumes {
                  + name = "audio-dev-config"

                  + secret {
                      + secret_name = "audio-dev-config"

                      + items {
                          + key  = "latest"
                          + path = "vector.yaml"
                        }
                    }
                }
            }
        }

      + traffic (known after apply)
    }

  # google_cloud_run_service_iam_policy.noauth will be created
  + resource "google_cloud_run_service_iam_policy" "noauth" {
      + etag        = (known after apply)
      + id          = (known after apply)
      + location    = "europe-west3"
      + policy_data = jsonencode(
            {
              + bindings = [
                  + {
                      + members = [
                          + "allUsers",
                        ]
                      + role    = "roles/run.invoker"
                    },
                ]
            }
        )
      + project     = "stalwart-camera-463819-k5"
      + service     = "audio-dev-collector"
    }

  # google_project_iam_binding.vector_config_secret_access will be created
  + resource "google_project_iam_binding" "vector_config_secret_access" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + members = [
          + "serviceAccount:361102057741-compute@developer.gserviceaccount.com",
        ]
      + project = "stalwart-camera-463819-k5"
      + role    = "roles/secretmanager.secretAccessor"
    }

  # google_pubsub_topic.vector_topic will be created
  + resource "google_pubsub_topic" "vector_topic" {
      + effective_labels = {
          + "goog-terraform-provisioned" = "true"
        }
      + id               = (known after apply)
      + name             = "vector-audio-dev-event"
      + project          = "stalwart-camera-463819-k5"
      + terraform_labels = {
          + "goog-terraform-provisioned" = "true"
        }

      + message_storage_policy (known after apply)
    }

  # google_secret_manager_secret.vector_config will be created
  + resource "google_secret_manager_secret" "vector_config" {
      + create_time           = (known after apply)
      + deletion_protection   = false
      + effective_annotations = (known after apply)
      + effective_labels      = {
          + "goog-terraform-provisioned" = "true"
        }
      + expire_time           = (known after apply)
      + id                    = (known after apply)
      + name                  = (known after apply)
      + project               = "stalwart-camera-463819-k5"
      + secret_id             = "audio-dev-config"
      + terraform_labels      = {
          + "goog-terraform-provisioned" = "true"
        }

      + replication {
          + user_managed {
              + replicas {
                  + location = "europe-west3"
                }
            }
        }
    }

  # google_secret_manager_secret_version.vector_config will be created
  + resource "google_secret_manager_secret_version" "vector_config" {
      + create_time            = (known after apply)
      + deletion_policy        = "DELETE"
      + destroy_time           = (known after apply)
      + enabled                = true
      + id                     = (known after apply)
      + is_secret_data_base64  = false
      + name                   = (known after apply)
      + secret                 = (known after apply)
      + secret_data            = (sensitive value)
      + secret_data_wo         = (write-only attribute)
      + secret_data_wo_version = 0
      + version                = (known after apply)
    }

Plan: 6 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + gcp_project           = "stalwart-camera-463819-k5"
  + gcp_region            = "europe-west3"
  + vector_domain         = ""
  + vector_service_id     = (known after apply)
  + vector_service_status = (known after apply)
  + vector_version        = "v0.18.5"

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```
✅ Review this plan and approve the deployment in Actions UI.